Информационная_база/src/Catalogs/ЛБТ_ТипыЗадач/ЛБТ_ТипыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛБТ_ТипыЗадач</name>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нормочасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ЛБТ_ШаблоныТиповЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Методика</name>
    <type>
      <types>CatalogRef.ЛБТ_МетодикаВнедрения</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ЛБТ_ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТипаЗадачи</name>
    <type>
      <types>CatalogRef.ЛБТ_НазванияТиповЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеСправочника</name>
    <attributes>
      <name>Нормочасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/ЛБТ_ТипыЗадач/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ДанныеСправочникаПриИзмененииНаСервере()
	
	Объект.Итого = 0;
	Для каждого СтрокаДанных Из Объект.ДанныеСправочника Цикл
		Объект.Итого = Объект.Итого + СтрокаДанных.Нормочасы
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСправочникаПриИзменении(Элемент)
	ДанныеСправочникаПриИзмененииНаСервере();
КонецПроцедуры
